      ******************************************************************
      * Author: Edwin Páez
      * Date: 20-05-22
      * Purpose: Practice COBOL
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST.
       AUTHOR.     EDWIN.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world".
            STOP RUN.
       END PROGRAM TEST.
