      * Programa que capture un nombre de 30X y un una cédula de 15 
       IDENTIFICATION DIVISION.
       PROGRAM-ID.        NO0C0001.
       AUTHOR.            NOVATEC (EDWIN PAEZ).
       INSTALLATION.      BBVA.
       DATE-WRITTEN.      03-06-22.
      *OBJETIVO: ESTE PROGRAMA MUESTA MI NOMBRE 
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       INICIO.
           DISPLAY 'EDWIN JESUS PAEZ RUEDA'
           STOP RUN.
          