       IDENTIFICATION DIVISION.
       PROGRAM-ID.                 NO0C0002.
       AUTHOR.                     NOVATEC (EDWIN PAEZ).
       INSTALLATION.               BBVA.
       DATE-WRITTEN.               06-06-22.
      *OBJETIVO: CAPTURA Y MUESTRA NOMBRE Y CEDULA Y SE MUESTRA CENTRADA
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-VARIABLES.
           02 WS-NOMBRE                  PIC X(30) VALUE SPACES.
           02 WS-CEDULA                  PIC 9(16) VALUE ZEROES.
           02 WS-PAUSA                   PIC X     VALUE SPACE.
       PROCEDURE DIVISION.
       INICIO.
           DISPLAY ERASE
           DISPLAY 'DATOS PERSONALES'    LINE 03 POSITION 32
           DISPLAY 'INGRESE SU NOMBRE: ' LINE 05 POSITION 05
           ACCEPT WS-NOMBRE              LINE 05 POSITION 24
           DISPLAY 'INGRESE SU CEDULA: ' LINE 07 POSITION 05
           ACCEPT WS-CEDULA              LINE 07 POSITION 24
           DISPLAY ERASE
           DISPLAY 'SUS DATOS SON: '     LINE 12 POSITION 08
           DISPLAY WS-NOMBRE             LINE 12 POSITION 27
           DISPLAY WS-CEDULA             LINE 12 POSITION 50
           DISPLAY '<OPRIMA ENTER>'      LINE 24 POSITION 33
           ACCEPT WS-PAUSA               LINE 24 POSITION 48
           STOP RUN.
