      ******************************************************************
      * Author: Edwin Páez
      * Date: 16-05-22
      * Purpose: Practice COBOL
      ******************************************************************
      * Sección #1 - Obligatoria
       IDENTIFICATION DIVISION.                                         Primera sección
       PROGRAM-ID.                      TEST.                              Título del programa
       AUTHOR.                          EDWIN-PAEZ.                        Autor del programa
       INSTALLATION.                    YOUTUBE.                           Donde está el programa
       DATE-WRITTEN.                    16/05/22.                          Fecha de creación
       DATE-COMPILED.                   16/05/22.                          Fecha de terminación
       REMARKS.                         CALCULADORA BÁSICA.                Descripción de lo que hace el programa

      * Sección #2
       ENVIRONMENT DIVISION.

      * Sección #3
       DATA DIVISION.

      * Sección #4
       PROCEDURE DIVISION.