      *PRIMERA SECCION COBOL - INFORMACION DEL MISMO
       IDENTIFICATION DIVISION.
       PROGRAM-ID.                     ITERATOR.
      *SEGUNDA SECCION COBOL - DATOS DE ENTRADA
       ENVIRONMENT DIVISION.
      *TERCERA SECCION COBOL - VARIABLES
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WSV-VARIABLES.
           05 WSV-CONTADOR              PIC Z(03) VALUE ZEROS.
           05 WSV-INC                   PIC Z(03) VALUE ZEROS.
      *CUARTA SECCION - PROCESOS
       PROCEDURE DIVISION.
       0-10-MAIN.
      *USO DE PERFORM TIMES
           PERFORM 040-VEC 3 TIMES
      *USO DE PERFORM UNTIL
           PERFORM 041-VEC UNTIL WSV-INC = 6 
           PERFORM 050-RETURN.
       0-10-FIN.
       040-VEC.
           ADD  1 TO WSV-CONTADOR
           DISPLAY 'EL VALOR DEL FOR ES DE: ' WSV-CONTADOR.
       041-VEC.
           ADD 1 TO WSV-INC
           DISPLAY 'EL VALOR DEL WHILE ES DE: ' WSV-INC.
       050-RETURN.
           STOP RUN.
       050-FIN.