       01  WS-FECHAS.
         02 FECHAS-ENTRADAS.
           05 WS-FORMATO          PIC 9.
         02 FECHAS-SALIDAS.
           05 WS-FORMATO-FECHA  PIC X(11).
           05 WS-FORMATO-HORA   PIC X(08).
         02 FECHAS-RETORNO.
           05 WS-RETORNO-FECHA    PIC XX.
